Repository: PHORAX/formhandler
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_formhandler_main.email_to
source: send formular field to this email
de: sende die Formularfelder an folgende Email

# tx_formhandler_main.email_subject
source: subject of email
de: Betreff der Email

# tx_formhandler_main.email_sender
source: email sender (email from)
de: Absende-Emailadresse

# tx_formhandler_main.email_redirect
source: redirect to this page (only if all "have-to" fields are filled out)
de: nach dem Abschicken zu dieser Seite weiterleten (nur wenn Mussfelder ausgefüllt wurden)

# tx_formhandler_main.email_requiredfields
source: these fields have to be filled out (enter name of formular field seperated by ",")
de: diese Felder müssen ausgefüllt sein (Name der Eingabefelder durch "," getrennt)

# tx_formhandler_main.email_htmltemplate
source: HTML-Template with formular fields in it
de: HTML-Template mit dem Formularfeldern

# tx_formhandler_main.email_html_as_attachment
source: send out html version of the output (if any) as an attachment instead of alternative to text
de: HTML Version der E-Mail as Attachment zur Plaintext-Version versenden

# tx_formhandler_main.email_sendtouser
source: optional: Send a confirmation email to user. Specify the input-field name where the user fills out his/her emailadress:
de: optional: Bestätigungs-Email an den User senden? Geben Sie hier den namen des Formularfeldes an, in dem der User seine Emailadresse angibt:

# tx_formhandler_main.email_subject_user
source: Subject of the mail to the user:
de: Betreff der Mail, die an den User geht:

# tx_formhandler_main.email_replyto
source: use the value of this submitted form-field as reply-to (optional, name of input field)
de: den Wert dieses ausgefüllten Eingabefeldes als reply-to verwenden (optional, Name des Formularfeldes)

# tx_formhandler_main.tx_formhandler_maxrows
source: Maximum number of rows (records) per page (zero = unlimited) in LIST-view
de: max. Anzahl Zeilen pro Seite (0 = unendlich) in der LIST-Anzeige

# tx_formhandler_main.tx_formhandler_singlepid
source: Id of the related page for the single data display
de: Id der Seite, die den kompletten Inhalt zeigt

# tt_content.tx_formhandler_contenttype.I.0
source: list
de: Liste

# tt_content.tx_formhandler_contenttype.I.1
source: single
de: Einzelansicht

# tt_content.tx_formhandler_contenttype
source: Type of data display
de: Art der Darstellung

# be_missing_config
source: No forms predefined
de: keine Vorlagen vorhanden

# be_please_select
source: Choose a predefined form
de: wählen Sie eine Vorlage

# be_defined_by_TS
source: Defined by TypoScript
de: Definiert durch TypoScript

# tx_formhandler_log
source: Formhandler log entry
de: Formhandler Logeintrag

# tx_formhandler_log.submission_date
source: Submission date
de: Absendedatum

# tx_formhandler_log.ip
source: IP address
de: IP-Addresse

# tx_formhandler_log.params
source: Submitted values
de: Abgeschickte Werte

# tx_formhandler_log.is_spam
source: Considered as SPAM
de: Als SPAM erkannt
